

import 'package:flutter/material.dart';

import '../model/landmark.dart';

class LandmarkController with ChangeNotifier{

  //bool _isFavorite = false;
  final List<Landmark> _landmark =  [
    Landmark(
        landmarkId: 'landmark1',
        landmarkName: 'الغوص في رأس محمد',
        landmarkDescription:[
          'تعد محمية "رأس محمد" من أفضل شواطئ وأماكن الغوص في العالم. فالجميع يتحدث عنها كبقعة من جنان الأرض، فوق الأرض وتحت المياه. إنه مكان نادر حيث أصبحت زيارة "رأس محمد" محطة إلزامية لدى كل سائح يصل منطقة شرم الشيخ في سيناء. ويتميز موقع "رأس محمد" عن غيره من مواقع الغوص والغطس بأنّ عناصر الجذب فيه تتوزع بين مناطقه التي فوق الماء وتلك التي تحته. فحتى أولئك الذين لا يتقنون الغوص والغطس أو لا يفضلانهما، يأتون إلى المكان بالآلاف من أجل التمتع بشواطئه النادرة الجميلة.',
          'ما يميز "رأس محمد" أيضًأ وقوعه عند مفترق طرق مائيّ هام، حيث أنّ التيارات المائية القادمة من خليج العقبة وخليج السويس والبحر الأحمر توفر كميات كبيرة من الغذاء للحياة البحرية في "رأس محمد"، ممّا يجعل الحياة السمكية والمرجانية فيه مكانًا لا ثاني له. فجرى حتى الآن توثيق أكثر من ٢٠٠ نوع من الشعب المرجانية و١,٠٠٠ نوع من الأسماك.',
          'يتراوح عمق منطقة الغطس في "رأس محمد" بين بضعة أمتار وحتى ٨٠٠ متر، تتخللها هضاب ومنزلقات والكثير من المناظر الساحرة تحت الماء. وقد طرأت تغيرات على مبنى الشاطئ والطبقات في المنطقة على مرّ آلاف السنين، فنشأت قبل ٧٠,٠٠٠ مناطق شاسعة من الشعب المرجانية النادرة، تتدلى إلى عمق قرابة ١٠٠ متر تحت سطح البحر. كما أنّ وقوع المنطقة بين التقاء مياه خليج العقبة بخليج السويس، أدى إلى اختلاط مياه من المنطقتين بدرجات ملوحة مختلفة، وبالتالي إلى نشوء أشكال خلابة ومختلفة من الشعب والسلاسل الصخورية إلى جانب وجود أسماك محيطية مختلفة ونادرة وجدران مرجانية ووافرة.',
          'من أجل الحفاظ على المحمية ونظافتها، يعكف حراس جوالون على تمشيط المحمية الطبيعية في رأس محمد بشكل دائم، بشطآنها ومياهها البحرية، من أجل الحفاظ على نظافتها البدئية. وإلى جانب كل ذلك، يزيد تميّز محمية رأس محمد عن المناطق السياحية الشعبية النادرة في العالم، بأنه لا توجد فيها مصبات أنهار أو وديان في شواطئها، وبالتالي تحافظ هذه الشطآن على ثباتها وخصوصيتها المحلية.',
          'في رحلة غوص واحدة تحت الماء يمكن الانتقال من سلسلة يولندا والقرش إلى مدينة شقائق النعمان، حيث تجد آلاف الأسماك وشقائق النعمان على عمق ١٠-٢٠ مترًا. في هذه الغطسة الطويلة يمكنك المرور بهذه الأمكنة والتمتع بغطس نادر جدًا في منطقة شرم الشيخ كلها.',
          '١) سلسلة صخور القرش وسلسلة صخور يولندا (Shark Reef & Yolanda Reef): لؤلؤة التاج في رأس محمد. تجدون فيها كل أنواع الأسماك المتوفرة في البحر الأحمر، خصوصًا في أشهر الصيف. فيها عقرب البحر (scorpionfish) التي نادرًا ما تُشاهد في أماكن غوص أخرى، إلى جانب حطام سفينة يولندا. فيهما وفرة من الشعب المرجانية وأسماك تونا وباركودا والقرش',
          '٢) منطقة شقائق النعمان (Anemone City): صخب وضجيج مدينة الأعماق، التي تحوي الممرات والمسارات المتفرعة من الشعب الصلبة والناعمة. وتخفي منطقة شقائق النعمان الخصيبة "جمهورًا" دائمًا من سمك شقائق النعمان (anemonefish) مع أنواع أخرى كثيرة من الأسماك، بحيث تُعتبر هذه المنطقة "مدينة أسماك كوزموبوليتية" بحق.',
          '٣) حديقة الأنقليس (Eel Garden) : قاعها رمليّ وكبير وفيها العديد من حدائق الأنقليس (ثعابين البحر) وحديقة مرجانية رائعة للتصوير.',
          '٤) رأس زعتر (Ras Za’atar): جدار جميل مغطى بالمرجان الناعم والكثير من الشقوق.',
          '٥) رأس غزلاني (Ras Ghozlany): سلسلة صخرية مائلة قليلا فيها شعب مرجانية كبيرة ومحاطة ببعض الشواطئ الرملية. تصلها عبر الشاطئ، وفيها ٣ مواقع للغوص، والكثير من الشعب المرجانية والحياة البحرية السمكية.',
          '٦) مرصد القرش(Sharks Observatory): يمكن الدخول إلى المرصد والخروج منه عبر كهف ضيق يتسع لغواص واحد، ومن ثم الوصول إلى حائط صخري رائع مليء بشعاب مراوح البحر (Gorgonian Fans) والكثير من أسماك الأنتياس    (AnthiaS)  وأسماك الديك (Lion Fish) وعقرب البحر (Scorpion Fish) وأحياناً سلحفاة المياه (Turtle).',
          '٧) البحيرة المسحورة (Hidden Bay): بعد المغامرة تحت سطح الماء قم بزيارة البحيرة المسحورة، أو بحيرة التّمنّي كما يُسمّيها البدو؛ فقد اعتاد البدو على السّباحة فيها منذ زمنٍ قديم، ورمي الحجارة فيها متمنّين بعض الأمنيات إيمانًا منهم بتحقيقها، فلا تنسَ أن تتمنّى أمنية هناك. اسبح واستمتع بمياهها، والرّمال الملونّة الّتي تسرّ النّاظرين وتُدهشهم لتنوّعها.',

        ],
        landmarkImagePath: [
          'assets/images/dive1.webp',
          'assets/images/dive2.webp',
          'assets/images/dive3.webp',
          'assets/images/dive4.webp'
        ],
    //  isFavorite: false

    ),
    Landmark(
        landmarkId: 'landmark2',
        landmarkName: 'التزحلق علي الماء',
        landmarkDescription: [
          'لا شك أن شرم الشيخ واحدة من أفضل وجهات ممارسة الرياضة المائية على البحر الأحمر. فبالإضافة إلى رياضة الغطس المدهشة، يمكنك خلال وجودك في شرم الشيخ تجربة أي رياضة مائية تقريبًا قد تخطر ببالك: الإبحار في الهواء، الإبحار بالمظلات، والانطلاق على متن المركب في الصباح الباكر.',
          'وتقدم معظم الفنادق والمنتجعات الكبرى في شرم مجموعة كبيرة من الأنشطة المائية، تشمل التزحلق على الماء في المنطقة المواجهة لها أو بالاتفاق مع منتجع آخر.',
          'وتعتبر شرم الواحة المفضلة عند المتزحلقين على الماء، فالخليج محمي بالكامل تقريبًا من الرياح لأنه يقع في مكان مثالي تحيط به الجبال. وبعد نزولك على أي من شواطئ شرم ستجد نواد رياضية مائية متخصصة ستوفر لك المعدات والمدربين الذين سيساعدونك في تعلم التزحلق على الماء أو تحسين مهاراتك في هذا المجال.',
          'لا جدال في أن خليج القروش يعتبر أفضل موقع للسباحة بقصبة التنفس على ساحل شرم الشيخ. وحيث إنه يقع على بُعد 20 كم من خليج نعمة الصاخب، يعتبر خليج القروش شاطئًا هادئًا يقود إلى جنة تحت الماء من الشعاب المرجانية وعالم الأسماك الملونة، تشمل سمك الراي اللسّاع المرقط ببقع زرقاء، ولكن لا توجد قروش.',
          'يُطلب منك دفع رسم دخول في خليج القروش، ولن تجد مشكلة في العثور على معدات السباحة بقصبة التنفس لاستئجارها و إستخدامها.',
          'ضع في حسبانك أن خليج القروش يمثل أيضًا نقطة انطلاق للسباحة بقصبة التنفس ورحلات مركب الغطس إلى المواقع المثيرة الموجودة في مضيق تيران. ويرحب بالمبحرين بالمظلات إذا ارادوا الانضمام، بحيث ان الكثير من الوجهات ممتازة و مناسبة للإبحار بالمظلات كما هو الحال بالنسبة للغطس.',
        ],
        landmarkImagePath: [
          'assets/images/skiing1.png',
          'assets/images/skiing2.png',
          'assets/images/skiing3.png'
        ],
      //  isFavorite: false
    ),
    Landmark(
        landmarkId: 'landmark2',
        landmarkName: 'الابحار بالمظلات',
        landmarkDescription: [
          'ينبغى عليكم الإستمتاع بالمشاهد البانورامية المدهشة المحيطة بساحل البحر الأحمر وجبال سيناء من خلال جولة في الهواء فوق البحر الأحمر عبر مظلة يجرها زورق يبحر في عرض البحر في شرم الشيخ ، وتحديداً في خليج نعمة. رغم أن الأمر يبدو صعبا ، إلا أن الإبحار بالمظلة سهل ولن تحتاجون إلا الى جهد بسيط للإنطلاق الى أعلى ثم الإسترخاء و الإستمتاع بالطيران في الهواء النقى.',
          'توجد منصة في مؤخرة المراكب السريعة التي تستخدم لهذه الرياضة و هى مصممة خصيصًا لتسهيل عملية الانطلاق ، و بعد مرور ما يقرب من خمسة عشرة دقيقة تتم عملية الهبوط عليها. تنتشر أندية الإبحار بالمظلات فى جميع أنحاء مدينة شرم الشيخ و يعد من السهل للغاية تنظيم رحلة كهذه من خلال الفندق الخاص بكم أو حتى مباشرة من شواطئ خليج نعمة الرائعة.',
        ],
        landmarkImagePath: [
          'assets/images/parasailing1.jpg',
          'assets/images/parasailing2.jpg'
        ],
       // isFavorite: false
    ),
  ];

  List<Landmark> get getLandmark => [..._landmark];


  Landmark findLandmarkById(int index ){
    return _landmark.elementAt(index);
  }
}