import 'package:flutter/material.dart';
import '../model/trip.dart';

class TripsController with ChangeNotifier{

  final List<Trip> _trip =  [
        Trip(tripId: 'trip1',
            tripName: 'الشواطئ في شرم الشيخ',
            tripDescription: [
              'خليج نعمه',
              'مكان تجد فيه كل ماتريده بشرم الشيخ',
              'إذا كنت ترغب في الذهاب إلى حيث تجد كل ما ترغب به، ليلاً ونهارًا، فإن وجهتك الفضلى هي خليج نعمة الرملي: هذا الخليج الرملي الجميل هو قلب شرم الشيخ النابض والمكان الأنسب للإقامة. تم بناء أول فندق في نعمة، هلنان مارينا شرم، عام 1980. وتعتبر المنطقة المقصد الأول لهواة الغوص الذين بامكانهم أن يستمتعوا بالشعاب المرجانية وأنواع الأسماك الملونة المدهشة. ويضم هذا القطاع الساحلي في شرم الشيخ العشرات من مراكز الغوص والفنادق الفخمة والمنتجعات الفاخرة. في هذا المكان يمكنك أن تجرب جميع أنواع الأنشطة الشاطئية والمائية، بما فيها رياضة ركوب القوارب الزجاجية والكاياك والإبحار بالمظلات وركوب الامواج وسائر انواع النشاطات البحرية، وأهمها بالطبع السباحة والاستلقاء تحت أشعة الشمس',
              'خليج القروش',
              'لايوجد قروش هنا',
              'يتغنى سكان شرم الشيخ بخليج القروش المعروف بمناظره الطبيعية الخلابة لكونه لا يزال يعكس روح شرم الشيخ الأصلية قبل تحولها الى مقصد سياحي عالمي: فهذا المكان يمنح زواره فرصة الاستجمام في جو لطيف ومريح والاستمتاع بالمناظر الطبيعية الآسرة لجزيرة تيران والمارينا.',
              'وثمة روايات متعددة عن أصل تسمية هذا الخليج، إذ يقول البعض إن أسماك القرش كانت تعيش بالفعل في هذا الخليج حتى 12 عامًا خلت، فيما يتحدث آخرون عن التباس حصل لدى بعض السياح الذين اعتقدوا ان أسماك المانتاس (شيطان البحار) هي من اسماك القرش، وبالتالي أطلقت على المنطقة تسمية خليج القروش، في حين تروي قصة أخرى أن الصيادين المحليين اعتادوا على تفريغ أسماك القرش التي اصطادوها في هذا الخليج تحديدًا. وأيًا كانت القصة الحقيقية، فهناك أمر مؤكد: لا أسماك قرش في خليج القروش اليوم!',
              'وقد تطور المشهد السياحي في هذا المكان ولم يعد بإمكانك أن تشاهد جملاً يسير بطول الشاطئ بين المقاهي والمنشآت الساحلية، لكن مع ذلك فقد حافظت شرم الشيخ على أصالتها وهي بمثابة جنة كما اعتادت أن تكون، علاوة على أنها تفخر بوجود بعض أفضل مناطق الغطس والغوص بقصبة التنفس. ومراكز الغطس الموجودة في المكان تلائم كافة مستويات الغواصين، وهناك مجموعة كبيرة من الأنشطة المائية المتوفرة لمن لا يحبون الغطس. كما يمكن الاستفادة من ركوب القوارب المقوسة والحلقية في الصباح الباكر والتزحلق على الأمواج... كلها أمثلة بسيطة على الخيارات المتاحة.',
            ],
            tripImagePath: [
              'assets/images/beach1.jpg',
              'assets/images/beach2.jpg',
              'assets/images/beach3.jpg',
              'assets/images/beach4.jpg',
            ],
          rating: 9.2
        ),
        Trip(tripId: 'trip2',
            tripName: 'الغوص فى شرم الشيخ',
            tripDescription: [
              'بدأ الغوص بالمعدات في البحر الأحمر في خمسينيات القرن الماضي عندما شرع العمال اليونانيون والإيطاليون بصيد الأسماك بالرمح أثناء فترة إقامتهم في مصر. وأظهرت الاستكشافات التي قام بها الدكتور هانز هاس، العالم النمساوي المتخصص في علوم الحيوان وأحد المخرجين المشاهير للأفلام التي تصوّر جوانب الحياة تحت سطح الماء، وجاك كوستو الغواص الفرنسي الشهير أن البحر الأحمر يحتوي على الكثير من تكوينات الشعاب المرجانية المدهشة التي تجتذب الآلاف من أنواع الكائنات البحرية.',
              'ومنذ ذلك الحين، شهدت رياضة الغوص تزايداً وانتشاراً كبيرين، ويوجد الآن الكثير من المنشآت المجهزة بكل المعدات اللازمة لممارسة هذه الرياضة، والسفن التي يمكن الإقامة فيها بضعة أيام لممارسة هذه الرياضة إلى جانب ما لا يعد ولا يحصى من البرامج والمدربين المعتمدين على المستوى العالمي في هذه الرياضة. وتعتبر منتجعات البحر الأحمر في الغردقة وشرم الشيخ ومرسى علم والجونة وطابا من أفضل الأماكن التي توفر البرامج والمنشآت السياحية لقضاء عطلات يستمتع فيها الزوار برياضة الغوص على مدار العام بفضل درجة الحرارة المعتدلة التي تتميز بها. وليس من المهم أن يكون قد سبق لك ممارسة رياضة الغوص، أو ما إذا كنت من المبتدئين أو المتمرسين فيها، ذلك لأنك سوف تجد البرنامج المناسب لك ومن المؤكد أنك سوف تعود مرة أخرى للحصول على مزيد من المتعة.',
            ],
            tripImagePath: [
              'assets/images/dive1.webp',
              'assets/images/dive2.webp',
              'assets/images/dive3.webp',
              'assets/images/dive4.webp',
            ],
          rating: 9.6
        ),
        Trip(tripId: 'trip3',
            tripName: 'رحــــــلات الســـفــارى',
            tripDescription: [
              'سوف تتيح لك رحلة السفاري فرصة الاستمتاع بمجموعة واسعة من أشكال الجمال الصحراوي المختلفة إلى جانب مشاهد غروب الشمس الخلابة والسماوات المرصعة بالنجوم ليلاً. واحرص على أن لا تفوتك مشاهدة المساكن المبنية بالطين والآثار القديمة التي تذخر بها الواحات القديمة في صحراء مصر، وقم بشراء منتجات الحرف اليدوية المحلية ولا تنس أن تستمتع بتدليك كتفيك لدى البدو الذين يتميزون بتقاليد قديمة تعود إلى قرون مضت - فالصحراء المصرية تعد من الأماكن المليئة بالطقوس والألغاز والتي تختفي فيها أساليب الحياة المعتادة، وهي مكان  تمثل فيه المياه كل شيء ولا يمثل فيه تملّك الأرض أي شيء.',
              'واكتشف معالم الأرض الطبيعية المدهشة مثل حقول زجاج السيليكا والأعمال الفنية المنحوتة في الصخر التي تعود إلى عصور ما قبل التاريخ في "كهف السباحين" أو في "كهف شاو" في الجلف الكبير. كذلك يمكنك أن تعيش تجربة مثيرة مذهلة بممارسة التزحلق على الرمال في بحر الرمال العظيم أو ركوب الدراجات الرباعية في الصحراء الغربية أو التخييم ليلاً وسط الكثبان الرملية وتحت السماء المرصّعة بالنجوم.',
              'للقيام برحلة سفاري في الصحراء المصرية، يرجى الاتصال بإحدى شركات السياحة المعتمدة. وفي سيناء، يمكن تنظيم رحلات سفاري قصيرة من خلال الفندق أو المنتجع الذي تنزل فيه أو عن طريق الاتصال بإحدى شركات السياحة في المدن الرئيسية في سيناء.',
              'للحصول على مزيد من المعلومات والصور وأشرطة الفيديو الخاصة بالصحراء المصرية، يرجى زيارة صفحة الصحراء المصرية على الفيس بوك',
            ],
            tripImagePath: [
              'assets/images/safari1.jpg',
              'assets/images/safari2.jpg',
              'assets/images/safari3.jpg',
              'assets/images/safari4.jpg',
            ],
          rating: 8.5
        ),
        Trip(tripId: 'trip4',
            tripName: 'الاماكن الليليه والمقاهى',
            tripDescription: [
              'سواء كنت تسافر منفردًا أو بصحبة شريك الحياة أو الأصدقاء أو الأطفال، هناك الكثير من وسائل الترفيه التي يمكنك التمتع بها في أوقات فراغك. أثناء النهار، يمكنك التجول في الحدائق والمتنزهات الخلابة في مدن مصر الرئيسية، مثل حدائق المنتزه في الإسكندرية وحديقة الأزهر في القاهرة، كما تستطيع أيضًا أن تحظى بجولة على ضفاف نهر النيل في أي مكان من وادي النيل في مصر قبل التوقف لتناول الغداء أو العشاء في أحد المطاعم العائمة الساحرة. كما يمكنك أن تجرّب الإبحار بالفلوكة للاستمتاع بالطريقة التقليدية للتنقل عبر نهر النيل.',
              'ويعدّ التسوق من أفضل الخيارات التي يمكنك أن تملأ بها أوقات الفراغ في جدول الرحلة. ستجد كل ما تتمناه في الأسواق التقليدية ومراكز التسوق الحديثة والمتاجر الأنيقة. كما ستجد العديد من دور السينما في القاهرة والمدن الرئيسية الأخرى. ويمكنك أيضًا اصطحاب أطفالك إلى المتنزهات الشهيرة أو اكتشاف المزيد عن مصر القديمة من خلال زيارة القرية الفرعونية في القاهرة.',
              'وعند الغروب يحين الوقت لارتداء ملابسك والخروج لاستكشاف البارات والملاهي الليلية والصالات الترفيهية في أبرز المدن المصرية، أو حضور حفل صاخب على متن اليخت في رحلة عبر البحر الأحمر أو التمتع بعشاء فاخر أثناء مشاهدتك للفقرات الترفيهية المباشرة على متن سفينة في رحلة نيلية.',
              'زياره ممشى خليج نعمه',
              'ويسمى بالشانزليزيه حيث يحتوى على العديد من المحلات التجاريه وكذلك المقاهى الليليه والعروض والفقرات الاستعراضيه',
              'Glass Boat  القارب الزجاجى',
              'وهي عبارة عن غواصة تحت البحر .. يكون قاعها من زجاج كي تتمكن من رؤية الأسماك والشعب المرجانية الملونة وهي في القاع',
              'العشاء البدوى',
              'هذا ليس مكان .. ولكنه عبارة عن نشاط يمكنك القيام به ويقدمه لك غالبية الفنادق هناك ، سيأخذك باصإلى هضبة عالية في شرم الشيخ من الساعة 7 مساءً وتجلسون في خيام ، ما عليك سوى اختيار مكان مناسب أو خيمة مناسبة لك ، وسيأتي لك الشاي والعشاء وطبعاً يكون بوفيه مفتوح .. كما يتخلل ذلك عروض بهلوانية ورقصات شعبية محترمة ويكون ذلك في جلسة بدوية جميلة',
              'عرض الدولفين',
              'يوجد عرضين في كل يوم .. وهو بالقرب من فندق ريتز كارلتون ، كل عرض يكون به أكثر من 500 شخص .. أغلبهم يكونوا من الروس والإيطاليين والعرب',
              'جزيره تيران',
              'هي رحلة رائعة على ظهر أحد اليخوت .. تأخذك لجزيرة قرب شرم الشيخ اسمها جزيرة تيران ، وسترى هناك السفينة الروسية الغارقة Gordon Reef ، خلال هذه الرحلة يتوقف اليخت أكثر من مرة في البحر كي يسمح للركاب بالسباحة أو عمل',
              'Snorkelling',
              'هو الطفو على سطح البحر وأنت على بطنك .. وذلك بارتداء أشياء خاصة تساعدك على الطفو .. ولا يشترط أن تتقن السباحة مطلقاً .. فقط ارتديها وتلبس معها نظارة مكبرة كي ترى الأعماق وأنت على السطح',
              'السوق القديم',
              'و هو عبارة عن سوق لبيع الأشياء الأساسية وليست الترفيهية .. مثل الفواكة أو الخضروات أو الأسماك ، كذلك ستجد فيه كروت شحن الموبايل بنفس أسعار القاهرة',
            ],
            tripImagePath: [
              'assets/images/night1.jpg',
              'assets/images/night2.jpg',
              'assets/images/night3.jpg',
              'assets/images/night4.jpg',
              'assets/images/night5.jpg',
              'assets/images/night6.jpg',
            ],
          rating: 8.2
        ),
  ];

  List<Trip> get getTrip => [..._trip];

  Trip findTripById(int index){
    return _trip.elementAt(index);
  }
}